#include "time.h"

u16 TIME_init=0;//定时器初值
/*******************************************************************************
* 函 数 名         : TimerInit
* 函数功能		   : 定时器初始化
* 输    入         : Chioce:0：选择定时器0初始化，1：选着定时器1初始化
                     ms_init:定时器时间
* 输    出         : 无
* 晶    振         : 11.0592M
*******************************************************************************/
void TimerInit(u8 Chioce,u8 ms_init)
{
	TIME_init=ms_init*1000;
	if(Chioce==0)
	{
      TMOD|=0X01;//选择为定时器0模式，工作方式1，仅用TR0打开启动。
	  TH0=(65536-TIME_init)/256;  //给定时器赋初值
	  TL0=(65536-TIME_init)%256;  
	  ET0=1;     //打开定时器0中断允许
	  TR0=1;     //打开定时器		
	}
	else
	{
	  TMOD|=0X10;//选择为定时器1模式，工作方式1，仅用TR1打开启动。
	  TH1=(65536-TIME_init)/256;  //给定时器赋初值
	  TL1=(65536-TIME_init)%256;  
	  ET1=1;     //打开定时器1中断允许
	  TR1=1;     //打开定时器		
	}
	EA=1;        //打开总中断		
}

// void Timer0Init()
// {
// 	//AUXR&=0X7f;//定时器1的速度是传统8051
//     //AUXR|=0X40;//定时器1的速度是传统8051的12倍
// 	TMOD|=0X51;//选择为定时器0模式，工作方式2，仅用TR0打开启动。
// 	           //选择为计数器1
//     TH1=0X00;
// 	TL1=0X00;

// //	TL0 = (65536-T1TMS);           //1T模式下初始装载值       
// //	TH0 = (65536-T1TMS) >> 8;      //1T模式下初始装载值  
//     TL0 = (65536-T12TMS);            //12T模式下初始装载值       
//     TH0 = (65536-T12TMS) >> 8;       //12T模式下初始装载值  
// 	ET0=1;    //打开定时器0中断允许
// 	EA=1;     //打开总中断
// 	TR0=1;    //打开定时器
//     TR1=1;	  //打开计数器
// }


/*******************************************************************************
* 函 数 名         : void Timer0() interrupt 1
* 函数功能		   : 定时器0中断函数
* 输    入         : 无
* 输    出         : 无
*******************************************************************************/
u16 TIME0COUNT=0;
u16 TIME1COUNT=0;
void Timer0() interrupt 1
{
  TH0=(65536-TIME_init)/256;  //给定时器赋初值
  TL0=(65536-TIME_init)%256;  
  TIME0COUNT++;
  if(TIME0COUNT==20)
  {
	  TIME0COUNT=0;
      Ds1302ReadTime();
  }
}

void Timer1() interrupt 3
{
  TH1=(65536-TIME_init)/256;  //给定时器赋初值
  TL1=(65536-TIME_init)%256;  
  TIME1COUNT++;
  if(TIME1COUNT==20)
  {
	  TIME1COUNT=0;
   
  }
}
