#include "lcd12864.h"

/*
**********************************************************************
*                         内部函数原型声明
**********************************************************************
*/
static void delay5ms(void);
static void delay500ms(void);

 
/*********************************************************************
* 函 数 名       : Lcd12864WaitNoBusy
* 函数功能		 : 阻塞等待LCD12864直到不忙状态
* 参数列表       : 无
* 函数输出    	 : 无
*********************************************************************/
static void Lcd12864WaitNoBusy(void)  //忙检测函数，判断bit7是0，允许执行；1禁止
{
    unsigned char sta = 0;           

    LCD12864_DATA_PORT = 0xff;
    gLcd12864_RS = 0;
    gLcd12864_RW = 1;
    do
    {
        gLcd12864_E = 1;
        sta = LCD12864_DATA_PORT;
        gLcd12864_E = 0;    //使能，用完就拉低，释放总线
    }while(sta & 0x80);
}


/*********************************************************************
* 函 数 名       : Lcd12864WriteCmd
* 函数功能		 : 按照LCD12864低层时序向LCD内部写入8位命令字
* 参数列表       : cmd - 待写入的8位命令字
* 函数输出    	 : 无
*********************************************************************/
static void Lcd12864WriteCmd(unsigned char cmd)	  
{
	Lcd12864WaitNoBusy();		   // 先等待LCD1602处于不忙状态

	gLcd12864_E = 0;     		   // 禁止LCD
	gLcd12864_RS = 0;	   		   // 选择发送命令模式
	gLcd12864_RW = 0;	   		   // 选择写入模式	
	LCD12864_DATA_PORT = cmd;  // 将1字节命令字放入8位并行数据端口
	gLcd12864_E = 1;	         // 使能LED
	gLcd12864_E = 0;				   // 禁止LCD
}


/*********************************************************************
* 函 数 名       : Lcd12864WriteData
* 函数功能		 : 按照LCD12864低层时序向LCD内部写入8位数据
* 参数列表       : dat - 待写入的8位命令字
* 函数输出    	 : 无
*********************************************************************/
static void Lcd12864WriteData(unsigned char dat)			
{
	Lcd12864WaitNoBusy();		   // 先等待LCD12864处于不忙状态

	gLcd12864_E = 0;     		   // 禁止LCD
	gLcd12864_RS = 1;	   		   // 选择发送数据模式
	gLcd12864_RW = 0;	   		   // 选择写入模式	
	LCD12864_DATA_PORT = dat;  // 将1字节命令字放入8位并行数据端口
	gLcd12864_E = 1;	         // 使能LED
	gLcd12864_E = 0;				   // 禁止LCD
}


/************* 上面是底层时序函数，下面是高层时序函数 ***************/

/*********************************************************************
* 函 数 名       : Lcd12864Init
* 函数功能		 : 按照LCD12864低层时序进行初始化序列
* 参数列表       : 无
* 函数输出    	 : 无
*********************************************************************/
void Lcd12864Init(void)						
{
	gLcd12864_PSB = 1;			  // 设置为8位并行总线

	// 发送初始化序列
 	Lcd12864WriteCmd(0x30);  	// 0x30为基本指令集
	Lcd12864WriteCmd(0x01);		// 0x01为清屏指令
	Lcd12864WriteCmd(0x06);  	// 地址自动加1
	Lcd12864WriteCmd(0x0c);		// 整体显示、游标关闭
}


/*********************************************************************
* 函 数 名       : Lcd12864ClearScreen
* 函数功能		 : 清屏，即清除屏幕整个显示内容
* 参数列表       : 无
* 函数输出    	 : 无
*********************************************************************/
void Lcd12864ClearScreen(void)						
{

	// 发送初始化序列
 	Lcd12864WriteCmd(0x01);  	// 0x01为清屏指令
//	Lcd12864WriteCmd(0x34);		// 0x34为扩充指令集
//	Lcd12864WriteCmd(0x30);  	// 0x30为基本指令集
}



/*********************************************************************
* 函 数 名       : Lcd12864ShowStr
* 函数功能		 : 从坐标(x, y)开始显示字符串str，注意这个函数不能跨行
*				   显示，因为显存地址是不连续的。
* 参数列表       : x - 横向坐标，范围是0-7
*				   y - 纵向坐标，范围是0-3
*				   pStr - 指向待显示的字符串的指针
* 函数输出    	 : 无
*********************************************************************/
void Lcd12864ShowStr(unsigned char x, unsigned char y, unsigned char *pStr)     //显示字符串
{
 	switch (y)
	{
		case 0:
			x |= 0x80;	break;
		case 1:
			x |= 0x90;	break;
		case 2:
			x |= 0x88;	break;
		case 3:
			x |= 0x98;	break;
		default:
						break;
	}
 	Lcd12864WriteCmd(x); 			// 发送地址码
  	while (*pStr != '\0') 			// 若到达字串尾则退出
  	{
     	Lcd12864WriteData(*pStr); //
     	pStr++;
	 	delay5ms();
  	}
}


/*********************************************************************
* 函 数 名       : Lcd12864ShowImage
* 函数功能		 : 显示一个128*64分辨率的2值位图。
* 参数列表       : pData - 指向待显示的位图图像数组指针		   
* 函数输出    	 : 无
*********************************************************************/
void Lcd12864ShowImage(unsigned char *pData)
{
	unsigned char x = 0, y = 0, i = 0;
	unsigned int tmp = 0;

	//分两屏，上半屏和下半屏，因为起始地址不同，需要分开
	for (i=0; i<9; i+=8)
	{		
		for (x=0; x<32; x++)
		{				//32行
			Lcd12864WriteCmd(0x36);       //扩充指令开启，开启绘图
			Lcd12864WriteCmd(0x80 + x);   //选择行，半屏32行	
			Lcd12864WriteCmd(0x80 + i);		// 行地址，下半屏，即第三行地址0X88
			Lcd12864WriteCmd(0x30);		    
			for (y=0; y<16; y++)	        //列控制，一次写8位数据，写16次 16*8=128；
			{
				Lcd12864WriteData(pData[tmp+y]);	// 将取数据写入LCD
			}
			tmp += 16;		
		}
	}
	Lcd12864WriteCmd(0x36);					// 扩充功能设定
	Lcd12864WriteCmd(0x30);
}


/*********************************************************************
* 函 数 名       : delay5ms
* 函数功能		 : 单片机小精灵V1.3生成的延时5ms的精确延时函数
* 参数列表       : 无
* 函数输出    	 : 无
*********************************************************************/
static void delay5ms(void)   //误差 0us
{
    unsigned char a,b;
    for(b=19;b>0;b--)
        for(a=130;a>0;a--);
}  


/*********************************************************************
* 函 数 名       : delay500ms
* 函数功能		 : 单片机小精灵V1.3生成的延时500ms的精确延时函数
* 参数列表       : 无
* 函数输出    	 : 无
*********************************************************************/
static void delay500ms(void)   //误差 0us
{
    unsigned char a,b,c;
    for(c=23;c>0;c--)
        for(b=152;b>0;b--)
            for(a=70;a>0;a--);
}
























